template.tex
% Created 2023-10-31 Tue 02:31
% Intended LaTeX compiler: pdflatex
\documentclass[8pt,a4paper]{article}

\pagenumbering{gobble}
\usepackage{array}
\usepackage[margin=2cm]{geometry}
\newcolumntype{L}{>{\raggedleft}p{0.14\textwidth}}
\newcolumntype{R}{p{0.78\textwidth}}
\renewcommand{\hline}{}
\setlength{\parindent}{0pt}
\renewcommand{\maketitle}{\begin{center}{\LARGE\bfseries \theauthor} \vspace{5pt} \smallbreak \thetitle \end{center}}
\author{Sameer Gupta\thanks{jasitis@gmail.com}}
\date{\today}
\title{+91-7993110170}
\begin{document}

\maketitle
\section*{Education}
\label{sec:org20c933a}

\begin{itemize}
\item B.Tech, IIT-Bombay (2006-11)
\end{itemize}

\section*{Skills}
\label{sec:orgef4abc7}

Given specified resources for specific goals, I have and can work with a small team and\\[0pt]
drive the development to meet the specifications, constrains and agreed  upon resources .
\section*{Relevant Experience}
\label{sec:org43b02a9}

\begin{center}
\begin{tabular}{{L!{\VRule}R}}
\hline
07/2021- & \textbf{Senior Haskell dev}, Konma -Chennai\\[0pt]
 & I worked with team to pitch for then ideascale .\\[0pt]
 & funding round and submitted my independent proposal\\[0pt]
 & in the next on with the founder .\\[0pt]
 & I used SBC, GPG to focus on network admin, nix\\[0pt]
 & for  reproduible builds and did haskell code review to\\[0pt]
 & assure type correctness of code.\\[0pt]
 & I listed many issue and prepared many solutions for\\[0pt]
 & Cardano.\\[0pt]
\hline
12/07-11/2021 & Prototype R\&D; New York Based Blockchain cotractor.\\[0pt]
 & I  Worked on bit blasting and decided to opt for retiming instead of pipelining in SBC ARM and RISC V.\\[0pt]
 & along with local procuremet and asssembly line testing.\\[0pt]
 & \\[0pt]
\hline
\end{tabular}
\end{center}

\section*{Languages and Tools}
\label{sec:orgc437963}

\begin{center}
\begin{tabular}{{L!{\VRule}R}}
\hline
Nix/NixOS & Repl, devenv, subshell,devshell, flake, modules. &  & \\[0pt]
 & Infra and network. On the way to build for SBC. &  & \\[0pt]
\hline
Bash and Emacslisp & For CI/CD,Magit-ops. &  & \\[0pt]
 & I have demonadtrated and pinned this on My Github &  & \\[0pt]
 & @carnotweat &  & \\[0pt]
\hline
Type correct haskell & For Haskell-nix builds, contribution,code-review &  & \\[0pt]
\hline
Elisp & I am confortable at calling, applying functions from any point &  & \\[0pt]
 & I and writing a emacs dsl, to make its keybinds my to my i3-config &  & \\[0pt]
\hline
\end{tabular}
\end{center}
\end{document}